---
type: BalusterInfo
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 12
tags: [revit-api, class]
---

# BalusterInfo

`Autodesk.Revit.DB.Architecture.BalusterInfo` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetReferenceNameForHost | 2020 | `public static string GetReferenceNameForHost ()` |
| Method | GetReferenceNameForTopRail | 2020 | `public static string GetReferenceNameForTopRail ()` |
| Property | BalusterFamilyId | 2019 | `public ElementId BalusterFamilyId { get ; set ; }` |
| Property | BaseOffset | 2019 | `public double BaseOffset { get ; set ; }` |
| Property | BaseReferenceName | 2019 | `public string BaseReferenceName { get ; set ; }` |
| Property | DistanceFromPreviousOrSpace | 2019 | `public double DistanceFromPreviousOrSpace { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Name | 2019 | `public string Name { get ; set ; }` |
| Property | Offset | 2019 | `public double Offset { get ; set ; }` |
| Property | TopOffset | 2019 | `public double TopOffset { get ; set ; }` |
| Property | TopReferenceName | 2019 | `public string TopReferenceName { get ; set ; }` |